---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.OnStandby
source: html/3e901c1a-530d-90a8-94a5-fba3b4f0d2fc.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.OnStandby Property

The number of pieces of mechanical equipment that are not operational at any given time.

## Syntax (C#)
```csharp
public int OnStandby { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: There should be at least one equipment on duty.